app/controllers/admin/categories_controller.rb

SELECT COUNT(*) FROM `categories`
SELECT `categories`.* FROM `categories` WHERE (name like '%#{query}%')  ORDER BY created_at DESC
SELECT  `categories`.* FROM `categories`  ORDER BY name ASC LIMIT 10 OFFSET 0
---
  def index
    @page_title = 'admin categories'
    if params[:search]
    @categories = Category.search(params[:search]).all.order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
    else
    @categories = Category.all.order('name ASC').paginate(:per_page => 10, :page => params[:page])

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Announcements', '2016-05-19 12:37:42', '2016-05-19 12:37:42')
---
  def create
    @category = Category.new(category_params)
    if @category.save

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def edit
    page_title = 'Edit Category'
    @category = Category.find(params[:id])

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `name` = 'News', `updated_at` = '2016-05-19 14:23:27' WHERE `categories`.`id` = 1
---
  def update
    @category = Category.find(params[:id])
    if @category.update(category_params)

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 6 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 6
---
  def destroy
    @category = Category.find(params[:id])
    if @category.destroy