app/controllers/admin/posts_controller.rb

SELECT  `posts`.* FROM `posts`  ORDER BY created_at DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM `posts`
---
  def index
  	@page_title = 'admin posts'
    if params[:search]
    @posts = Post.search(params[:search]).all.order('created_at DESC').paginate(:per_page => 5, :page => params[:page])

INSERT INTO `posts` (`title`, `category_id`, `user_id`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `tags`, `body`, `created_at`, `updated_at`) VALUES ('New RoR tutorial \'Learning doing\'', 3, 1, '3.jpg', 'image/jpeg', 7393, '2016-05-20 18:32:29', 'RoR', 'ontrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old. Richard McClintock, a Latin professor at Hampden-Sydney College in Virginia, looked up one of the more obscure Latin words, consectetur, from a Lorem Ipsum passage, and going through the cites of the word in classical literature, discovered the undoubtable source. Lorem Ipsum comes from sections 1.10.32 and 1.10.33 of \"de Finibus Bonorum et Malorum\" (The Extremes of Good and Evil) by Cicero, written in 45 BC. This book is a treatise on the theory of ethics, very popular during the Renaissance. The first line of Lorem Ipsum, \"Lorem ipsum dolor sit amet..\", comes from a line in section 1.10.32.\r\n\r\nThe standard chunk of Lorem Ipsum used since the 1500s is reproduced below for those interested. Sections 1.10.32 and 1.10.33 from \"de Finibus Bonorum et Malorum\" by Cicero are also reproduced in their exact original form, accompanied by English versions from the 1914 translation by H. Rackham.', '2016-05-20 18:32:29', '2016-05-20 18:32:29')
---
  def create
    @post = Post.new(post_params)

    if params[:post][:image].blank?
      @post.image = nil
    end

    if @post.save

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
  def edit
    page_title = 'Edit Post'
    @post = Post.find(params[:id])

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `image_file_name` = NULL, `image_content_type` = NULL, `image_file_size` = NULL, `image_updated_at` = NULL, `body` = 'Code School: Good interactive online programming courses\r\nThe Turing School of Software & Design: a full-time, 27-week training program in Denver, Colorado, with a $500 discount for Rails Tutorial readers using the code RAILSTUTORIAL500\r\nBloc: an online bootcamp with a structured curriculum, personalized mentorship, and a focus on learning through concrete projects. Use the coupon code BLOCLOVESHARTL to get $500 off the enrollment fee.\r\nLaunch School: A good online Rails development bootcamp (includes advanced material)\r\nFirehose Project: A mentor-driven, online coding bootcamp focused on real-world programming skills like test-driven development, algorithms, and building an advanced web application as part of an agile team. Two-week free intro course.\r\nThinkful: An online class that pairs you with a professional engineer as you work through a project-based curriculum\r\nPragmatic Studio: Online Ruby and Rails courses from Mike and Nicole Clark. Along with Programming Ruby author Dave Thomas, Mike taught the first Rails course I took, way back in 2006.\r\nRailsApps: A large variety of detailed topic-specific Rails projects and tutorials\r\nRails Guides: Topical and up-to-date Rails references', `updated_at` = '2016-05-23 05:35:07' WHERE `posts`.`id` = 4
---
  def update
    @post = Post.find(params[:id])

    if params[:post][:image].blank?
      @post.image = nil
    end

    if @post.update(post_params)