app/controllers/admin/users_controller.rb

SELECT `users`.* FROM `users` WHERE (name like '%#{query}%' OR email like '%#{query}%')  ORDER BY name ASC
---
  def index
    @page_title = 'admin users'
    if params[:search]
    @users = User.search(params[:search]).all.order('name ASC').paginate(:per_page => 10, :page => params[:page])

INSERT INTO `users` (`name`, `email`, `password_salt`, `password_hash`, `created_at`, `updated_at`) VALUES ('consen', 'consen@consen.org', '$2a$10$wz.tBJSW9l6BHuJ4fS04/u', '$2a$10$wz.tBJSW9l6BHuJ4fS04/uJL14zc1xmLK7vnaSHlKuoiupgEJqR6C', '2016-05-20 07:11:48', '2016-05-20 07:11:48')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    page_title = 'Edit User'
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `email` = 'cons@cons.org', `password_salt` = '$2a$10$if8UBGUKXulUyjICaiJjRO', `password_hash` = '$2a$10$if8UBGUKXulUyjICaiJjRO7Q3RfguFro4RsNCrQCEjhqMcAGK5biG', `updated_at` = '2016-05-20 10:42:10' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)