app/views/admin/posts/edit.html.erb

		<%= f.label :category %><br />
		<%= f.select :category_id, Category.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select one'},	class:'form-control' %><br />
---
SELECT `categories`.* FROM `categories`

		<%= f.label :author %><br />
		<%= f.select :user_id, User.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select one'},	class:'form-control' %><br />
---
SELECT `users`.* FROM `users`