app/views/posts/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
            <h3><%= p.title.truncate(30) %></h3>
              <small>Posted by <%= @users.find(p.user_id).name %> on <%= p.created_at.to_time %></small>