app/views/posts/show.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
	<h2 class='page-header'><%= @post.title %></h2>
	<small>Posted by <%#= @users.find(@post.user_id).name %> on <%#= @post.created_at.to_time.strftime('%B %e at %l:%M %p') %></small>