app/controllers/comments_controller.rb

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`name`, `email`, `body`, `post_id`, `created_at`, `updated_at`) VALUES ('fcv', 'fcv@fcv.com', 'fffffffffffffffffffffff', 2, '2016-05-21 12:05:52', '2016-05-21 12:05:52')
---
  def create
  	@post = Post.find(params[:post_id])
  	@comment = @post.comments.create(params[:comment])