app/controllers/posts_controller.rb

  def index

    @page_title = 'Posts'

    @posts = Post.all
    @categories = Category.all
    @users = User.all

    if params[:search]
    @posts = Post.search(params[:search]).all.order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
---
SELECT `posts`.* FROM `posts`
SELECT `categories`.* FROM `categories`
SELECT  `posts`.* FROM `posts`  ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def show
    @posts = Post.all
    @users = User.all
  	@post = Post.find(params[:id])
  	@categories =Category.all
  	@comment = Comment.new
  	@comments = Comment.all
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1