app/views/layouts/partials/_comments.html.erb

<div class="comments">
	<h2 class='page-header'><%= @post.comments.length %> Comments</h2>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1